quation 1:

In [1]:
import pandas as pd

In [9]:
data=[4.8,15,16,23,42]
series=pd.Series(se)
print(series)

0     4.8
1    15.0
2    16.0
3    23.0
4    42.0
dtype: float64

quation 2:

In [10]:
l=[1,2,3,4,5,6,7,8,9,10]
se1=pd.Series(l)
print(se1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

quation 3:

In [11]:
data1={
    "name":["alice","bob","claire"],
    "age":[25,30,27],
    "gender":["female","male","female"]
}
df=pd.DataFrame(data1)
print(df)

     name  age  gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

quation 4:

in panadas dataframe is a two dimensional ,size mutable,heterogeneous tabular data structure .it is essentially
 a table of data with rows and column where each column conatin different data types on other side series is a
 one dimensional labeled array capable of holding data of any type.

In [14]:
# Creating a series
data2=[1,2,3,4,7,56]
se2=pd.Series(data2)
print(se2)
#Creating a dataframe
data3={"name":["avinash","ayush","aditya"],"age":[26,18,19],"city":["neri","umred","bhadrawati"]}
df1=pd.DataFrame(data3)
print(df1)

0     1
1     2
2     3
3     4
4     7
5    56
dtype: int64
      name  age        city
0  avinash   26        neri
1    ayush   18       umred
2   aditya   19  bhadrawati

quation 5:

selection and filtering:
     df[columns]:select specific column from dataaframe
     df.loc[] and df.iloc: select rows column by labels or integer location

quation 6:
series : You can modify the elements of a Series after it has been created. For example, you can change the values of specific elements by assigning new values to them.

DataFrame: DataFrames are also mutable. You can add or remove columns, change values, and perform various operations to modify the structure and content of a DataFrame.

Panel: The Panel data structure was deprecated in Pandas and removed in version 0.25.0. It was considered less useful and versatile compared to DataFrames, and it is no longer part of the Pandas library. Therefore, you won't encounter Panels in modern Pandas versions

quation 7:

In [21]:
se1=pd.Series([1,2,4,5,6,7])
se2=pd.Series([4,1,8,9,6,1,3])
df4=pd.DataFrame({"column1":se1,"column2":se2})
df4

   column1  column2
0      1.0        4
1      2.0        1
2      4.0        8
3      5.0        9
4      6.0        6
5      7.0        1
6      NaN        3